Rhino.Inside.Revit API
GeometryEncoder.ToTransform Method
 Converts the specified Rhino.Geometry.Transform to an equivalent Autodesk.Revit.DB.Transform.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Autodesk.Revit.DB.Transform ToTransform(
	this Rhino.Geometry.Transform transform
)
@staticmethod
def ToTransform(
	transform: Rhino.Geometry.Transform
) -> Autodesk.Revit.DB.Transform
Parameters
transform
Type: Rhino.Geometry.Transform
Rhino transform to convert.
Return Value
Type: Autodesk.Revit.DB.Transform
Revit transfrom that is equivalent to the provided Rhino transform.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Rhino.Geometry.Transform. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToTransform(Transform) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Transform revitTransform = rhinoTransform.ToTransform();
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
revit_transform = rhino_transform.ToTransform()    # type: DB.Transform
 Using ToTransform(Transform) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
DB.Transform revitTransform = GeometryEncoder.ToTransform(rhinoTransform);
import clr
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryEncoder as GE
revit_transform = GE.ToTransform(rhino_transform)    # type: DB.Transform
See Also
Reference
GeometryEncoder Class
RhinoInside.Revit.Convert.Geometry Namespace